Repository: fredmorcos/katoob
Catalog: po/*.po
Languages: ar, ja

source: Katoob
ar: كتوب

source: Multilingual Unicode Text Editor
ar: محرر نصوص متعدد اللغات
ja: 多国語対応Unicodeテキストエディタ

source: Katoob is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
ar: كتوب برنامج حر، يمكنك توزيعه و/أو تعديله حسب بنود رخصة جنو العمومية كما نشرتها مؤسسة البرامج الحرة، الإصدار الثاني أو أي إصدار أحدث (حسب رغبتك).

source: Katoob is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
ar: كتوب يوزع على أمل أن يكون مفيدًا، ولكن دون أية ضمانات، بما في ذلك ضمانات قابلية البرنامج للتسويق أو الملاءمة لغرض معين. انظر نص رخصة جنو العمومية لمزيد من التفاصيل.

source: You should have received a copy of the GNU General Public License along with This program; if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
ar: من المفترض أنك تلقيت نسخة من رخصة جنو العمومية مع هذا البرنامج؛ إذا لم يحدث هذا فاكتب إلى: Free Software Fondation Inc., 59 Temple Place - Suite 330, Boston, MA 02111 - 1307, USA

source: Copyright © 2006, 2007 Mohammed Sameer.
ar: حقوق النسخ © 2006، 2007 محمد سمير.

source: Mohammed Sameer
ar: محمد سمير

source: Mostafa Hussein
ar: مصطفى حسين

source: A lightweight multilingual unicode and bidi aware text editor
ar: محرر نصوص متعدد اللغات يراعي يونيكود وثنائية الاتجاه

source: translator-credits
ar: محمد سمير خالد حسني
ja: UTUMI Hirosi <utuhiro78@yahoo.co.jp>

source: _Enable undo, redo
ar: اع_رض قائمة التراجع
ja: アンドゥ/リドゥを有効に(_E)

source: Keep a history of recently closed documents
ar: احفظ سجل بالمستندات المغلقة حديثا
ja: 最近閉じた文書の履歴を保持する

source: Undo history size (0 for unlimited)
ar: عدد المرات للتراجع (اختر 0 لعدد غير محدود)
ja: アンドゥ履歴のサイズ (0 で無制限)

source: Executed commands history size (0 for unlimited)
ar: حجم سجل الأوامر المنفذة (اختر 0 لعدد غير محدود)
ja: コマンド実行履歴のサイズ (0 で無制限)

source: Closed documents history size (0 for unlimited)
ar: حجم سجل المستندات المغلقة (اختر 0 لعدد غير محدود)
ja: 閉じた文書の履歴のサイズ (0 で無制限)

source: Show the extra _buttons
ar: اعرض الأزرار الإ_ضافية
ja: 拡張ボタンを表示(_b)

source: Show the _Main Toolbar
ar: اعرض شريط الأدوات ال_رئيسي
ja: メインツールバーを表示(_M)

source: Show the _Extended Toolbar
ar: اعرض شريط الأدوات الإ_ضافي
ja: 拡張ツールバーを表示(_E)

source: Show the _Statusbar
ar: اعرض شريط ال_حاله
ja: ステータスバーを表示(_S)

source: Enable re_cent menu
ar: اعرض قائمة الملفات الح_ديثة
ja: 履歴を有効に(_c)

source: Show the _close button on each tab label
ar: اعرض زر الإ_غلاق لكل ملف مفتوح
ja: タブごとに'閉じる'ボタンを表示

source: No. of recent entries (0 for unlimited)
ar: عدد الملفات الحديثة (اختر 0 لعدد غير محدود)
ja: 履歴の数 (0 で無制限)

source: Show the toolbar as
ar: اعرض شريط الأدوات
ja: ツールバーの表示

source: Text only
ar: نص فقط
ja: 文字のみ

source: Icons only
ar: أيقونات فقط
ja: アイコンのみ

source: Both
ar: كلاهما
ja: 両方

source: Text beside icons
ar: نص بجانب الأيقونات
ja: アイコンの横に文字

source: _Show tabs
ar: ا_عرض الألسنة
ja: タブを表示(_S)

source: _Enable tabs menu
ar: اعر_ض قائمة الألسنة
ja: タブのメニュー有効(_E)

source: Scro_ll tabs
ar: _قائمة تمرير الألسنة
ja: タブをスクロール(_l)

source: Show the tabs at the
ar: مكان الألسنة
ja: タブの位置

source: Top
ar: أعلى
ja: 上

source: Bottom
ar: أسفل
ja: 下

source: Right
ar: يمين
ja: 右

source: Left
ar: يسار
ja: 左

source: Color for read only tabs
ar: لون ألسنة القراءة فقط
ja: 読み取り専用タブの色

source: Color for modified tabs
ar: لون الألسنة ذات التعديلات
ja: 変更したタブの色

source: Color for normal tabs
ar: اللون التلقائي للألسنة
ja: 通常のタブの色

source: Text _Wrapping is on by default
ar: _طي النص هو الوضع الافتراضي
ja: テキストをデフォルトで折り返す(_W)

source: Show _Line numbers by default
ar: اعرض أرقام الأ_سطر
ja: 行番号をデフォルトで表示

source: Use the default _font
ar: استخدم ال_خط الافتراضي
ja: デフォルトのフォントを使う(_f)

source: _Automatic syntax highlighting for known file types
ar: توضيح التركيب للملفات المعروفة آل_يا

source: Line numbers position
ar: مكان أرقام الأسطر
ja: 行番号の位置

source: Font
ar: الخط
ja: フォント

source: Tab width
ar: عرض اللسان

source: _Use the locale encoding
ar: ا_ستخدم الترميز المحلّي
ja: ロケールのエンコーディングを使う(_U)

source: Specify an encoding
ar: حدد ترميزا
ja: エンコーディングを指定

source: File open encoding
ar: ترميز الفتح
ja: ファイルを開くときのエンコーディング

source: File save encoding
ar: ترميز الحفظ
ja: ファイルを保存するときのエンコーディング

source: _Backup files before saving.
ar: _نسخة احتياطية للملفات قبل الحفظ
ja: 保存前にファイルをバックアップ(_B)

source: Backup extension
ar: امتداد النسخ الاحتياطية
ja: バックアップの拡張子

source: _Autocheck Spelling
ar: تدقيق إملائي آ_لي
ja: スペルを自動確認(_A)

source: Choose the default dictionary
ar: اختر القاموس الافتراضي
ja: デフォルトのディレクトリを選択

source: Printing font
ar: خط الطباعة
ja: 印刷時のフォント

source: _Enable advanced options
ar: _فعِّل الخيارات المتقدمة
ja: 高度なオプションを有効に(_E)

source: X Dot Per Inch
ar: س نقطة في البوصة
ja: インチ当たりのドット数(X)

source: Y Dot Per Inch
ar: ص نقطة في البوصة
ja: インチ当たりのドット数(Y)

source: _Enable the dictionary.
ar: _فعِّل القاموس.
ja: 辞書を有効にする(_E)

source: Host
ar: المستضيف
ja: ホスト

source: _List dictionaries
ar: ا_سرد القواميس
ja: 辞書をリスト表示(_L)

source: Port
ar: المنفذ
ja: ポート

source: Dictionary
ar: القاموس
ja: 辞書

source: Description
ar: الوصف
ja: 説明

source: Not Available.
ar: الخدمة غير متوفرة.
ja: 利用不可

source: Failed to get the available dictionaries.
ar: تعذّر الحصول على القواميس المتاحة.

source: Please provide a dict server
ar: فضلًا حدد خادم dict

source: _Milliseconds before multipress will accept the current value.
ar: الزمن بالمللي ثانيه قبل أن تُقبل القيمة الحالية.

source: Number of remote addresses to save (0 for unlimited)
ar: عدد المواقع المحفوظة (اختر 0 لعدد غير محدود)
ja: 保存するリモートアドレスの数 (0 で無制限)

source: _Insert into the active document enabled by default ?
ar: الإ_دراج في الملف المفتوح ممكن في الوضع الافتراضي ؟
ja: アクティブな文書への挿入をデフォルトで有効に(_I)

source: Width
ar: العرض
ja: 幅

source: Height
ar: الارتفاع
ja: 高さ

source: Save all the program _settings on exit
ar: احفظ الإ_عدادات عند الخروج
ja: 終了時に全てのプログラムの設定を保存(_s)

source: Save the main window _attributes on exit
ar: احفظ إعدا_دات النافذة الرئيسية عند الخروج
ja: 終了時にメインウィンドウの設定を保存(_a)

source: Window position
ar: مكان النافذة الرئيسية
ja: ウィンドウの位置

source: Window size
ar: مقاس النافذة الرئيسية
ja: ウィンドウのサイズ

source: Network timeout (In seconds):
ar: مهلة الشبكة (بالثواني):

source: Proxy host:
ar: مستضيف الوكيل:

source: Proxy port:
ar: منفذ الوكيل:

source: Proxy type:
ar: نوع الوكيل:

source: None
ar: بدون

source: Get from the environment
ar: احصل عليه من البيئة

source: Tunnel traffic through the proxy
ar: مرور النفق عبر الوكيل

source: Use proxy authentication
ar: استخدم استيثاق الوكيل

source: Proxy username:
ar: اسم مستخدم الوكيل:

source: Proxy password:
ar: كلمة سر الوكيل:

source: Insert to document
ar: أدرِج في الملف

source: Goto Line
ar: اذهب إلى سطر
ja: 行へ移動

source: Line:
ar: سطر:
ja: 行:

source: Please wait...
ar: فضلًا انتظر...

source: Invalid daatabase. Please reconfigure the dictionary in use.
ar: قاعدة بيانات غير صحيحة. فضلًا أعد إعداد القاموس المستخدم.

source: No matches were found
ar: لم يُعثر على نتائج

source: No databases were found.
ar: لم يُعثر على قاعدة البيانات.

source: Is a directory.
ar: دليل
ja: はディレクトリです

source: Couldn't detect the encoding of %s
ar: لا يمكن تحديد ترميز الملف %s
ja: %s のエンコーディングを検出できません

source: Couldn't detect the encoding of the text.
ar: لا يمكن تحديد ترميز النص
ja: テキストのエンコーディングを検出できません

source: Failed to create the autorecovery file %s
ar: فشل إنشاء ملف الاستعادة التلقائية %s

source: Define
ar: عرِّف
ja: 定義

source: Spelling Suggestions
ar: اقتراحات المدقق الإملائي
ja: スペルを提案

source: Add "%s" to dictionary
ar: أضف "%s" للقاموس
ja: "%s" を辞書に追加

source: no suggestions
ar: لا توجد اقتراحات
ja: 提案なし

source: More...
ar: المزيد...
ja: もっと..

source: I wasn't able to convert the encoding.
ar: لم أتمكن من تحويل ترميز النص

source: Command to execute
ar: الأمر
ja: 実行するコマンド

source: '%s' will be substituted with a temporary filename containing the text from the document.
ar: سيُستبدل '%s' باسم ملف مؤقت يحتوي علي النص.
ja: 文書に含まれているテキストから '%s' を一時的なファイル名にします

source: _Show the results in a new tab
ar: ا_عرض النتائج في لسان جديد
ja: 結果を新規タブに表示(_S)

source: _Text file with no unicode control characters...
ar: ملف _نصي بدون رموز تحكم يونيكود
ja: unicode 制御文字なしのテキストファイル(_T)

source: Text file compressed with _gzip
ar: ملف نصي مضغوط ب‍ _gzip
ja: gzip で圧縮したテキストファイル(_g)

source: Text file compressed with _bzip2
ar: ملف نصي مضغوط ب‍ _bzip2
ja: bzip で圧縮したテキストファイル(_b)

source: Text with _shaping and bidi applied
ar: نص _متصل الحروف مع ثنائية الاتجاه
ja: 整形と bidi を適用したテキスト(_s)

source: Can't open temporary file.
ar: لا يمكن إنشاء ملف مؤقت
ja: 一時ファイルを開けません

source: Error writing to temporary file.
ar: خطأ أثناء الكتابة في الملف المؤقت.
ja: 一時ファイルに書き込めません

source: Couldn't allocate memory for compression.
ar: لا يمكن تخصيص مساحة كافية من الذاكرة للضغط.
ja: 圧縮用にメモリを割り当てることができません

source: Couldn't compress the text.
ar: لم أتمكن من ضغط الملف.
ja: テキストを圧縮できません

source: Couldn't apply the bidi algorithm.
ar: لا يمكن تطبيق خوارزمية ثنائية الاتجاه.
ja: bidi アルゴリズムを適用できません

source: Encoding
ar: الترميز
ja: エンコーディング

source: This is a directory.
ar: هذا دليل.
ja: これはディレクトリです

source: _HTML Character Reference...
ar: بطريقة _HTML...
ja: HTML キャラクタレファレンス(_H)

source: Can't open file.
ar: لا يمكن فتح الملف.
ja: ファイルを開けません

source: Error reading file.
ar: خطأ في قراءة الملف.
ja: ファイルの読み込みエラー

source: Input Window
ar: نافذة الإدخال

source: Untitled New %d
ar: جديد بدون عنوان %Id
ja: 新規 %d

source: Failed to scan for any autorecovery files: %s
ar: فشل البحث عن ملفات الاستعادة التلقائية: %s

source: Some unrecovered files were found. Try to recover them ?
ar: وُجِدت بعض الملفات غير المستعادة. أأحاول استعادتهم ؟

source: Please select a file for editing.
ar: انتقِ ملفا لتحريره.
ja: 編集するファイルを選んでください

source: This is a read only document.
ar: هذا المستند للقراءة فقط.
ja: 読み取り専用文書です

source: Please select a file.
ar: فضلا اختر ملفا.
ja: ファイルを選んでください

source: This document can not be saved. It's a read only file.
ar: لا يمكنك حفظ هذا المستند لأنه للقراءة فقط.
ja: この文書を保存できません。読み取り専用ファイルです

source: Please select a file for saving.
ar: اختر ملفًا للحفظ.
ja: 保存するファイルを選んでください

source: Are you sure you want to overwrite the file %s ?
ar: أمتأكد أنك تريد إعادة الكتابة على الملف %s ؟
ja: ファイル %s を上書きしますか？

source: The file %s is not saved, Save first ?
ar: لم يُحفظ الملف %s. أتريد الحفظ أولا؟
ja: ファイル %s を保存していません。保存しますか？

source: "%s" is not saved, Save first?
ar: لم يُحفظ الملف %s. أتريد الحفظ أولا؟
ja: "%s" を保存していません。保存しますか？

source: The file "%s" doesn't exist.
ar: الملف "%s" غير موجود.

source: This will close the current file "%s". Discard any changes done and reload the saved copy of the file. Are you sure you want to continue ?
ar: هذا سيُغلق الملف "%s" و يعيد فتحه أي تغييرات غير محفوظه ستُفقد. أمتأكد أنك تريد الاستمرار ؟
ja: 現在のファイル "%s" を閉じます。全ての変更を破棄して保存済みのファイルを再読み込みします。続けますか？

source: You must inter a word to search for.
ar: يجب إدخال كلمة للبحث عنها.
ja: 検索する単語を入力してください

source: No search results found.
ar: لم يُعثر على أي نتائج.
ja: 合致するものがありません

source: Replaced %d occurence.
ar: لم تُستبدل أية تواجدات

source: You can use only one '%s'
ar: يمكن استخدام '%s' مرة واحدة فقط
ja: '%s' は１個だけ使えます

source: Failed to get any definitions.
ar: فشل الحصول على أي تعريفات.

source: _File
ar: _ملف
ja: ファイル(_F)

source: Open _Location...
ar: ا_فتح موقع...
ja: 場所を開く(_L)

source: Recent
ar: الملفات الحديثة
ja: 履歴

source: Sa_ve Copy...
ar: ا_حفظ نسخه...
ja: コピーを保存(_v)

source: _Import
ar: ا_ستورد
ja: インポート(_I)

source: _Export
ar: _صدِّر
ja: エクスポート(_E)

source: Page Set_up...
ar: إ_عداد الصفحة...

source: Print Previe_w
ar: _معاينة الطباعة

source: _Edit
ar: _حرِّر
ja: 編集(_E)

source: _Select All
ar: انتقِ ال_كل
ja: 全て選択(_S)

source: _Insert File
ar: أدرِج _ملف
ja: ファイルを挿入(_I)

source: _Search
ar: ا_بحث
ja: 検索(_S)

source: Find Ne_xt
ar: اعثر على ال_تالي
ja: 次を検索(_x)

source: _View
ar: _عرض
ja: 表示(_V)

source: _Statusbar
ar: _شريط الحالة
ja: ステータスバー(_S)

source: _Line Numbers
ar: أ_رقام الأسطر
ja: 行番号(_L)

source: _Wrap Text
ar: _طي النص
ja: テキストを折り返す(_W)

source: Toolbars
ar: أشرطة الأدوات
ja: ツールバー

source: _Main Toolbar
ar: شريط الأدوات ال_رئيسي
ja: メインツールバー(_M)

source: _Extended Toolbar
ar: شريط الأدوات الإ_ضافي
ja: 拡張ツールバー(_E)

source: _Encoding
ar: ال_ترميز
ja: エンコーディング(_E)

source: _Tools
ar: أ_دوات
ja: ツール(_T)

source: _Execute Command On Buffer...
ar: _نفِّذ أمر على النص...
ja: バッファでコマンドを実行(_E)

source: Input
ar: الإدخال

source: Default
ar: الافتراضي

source: Keyboard emulator
ar: محاكي لوحة المفاتيح
ja: キーボードエミュレータ

source: Multipress
ar: متعدد الضغطات

source: _Documents
ar: ال_مستندات
ja: 文書(_D)

source: Save _All
ar: احفظ ال_كل
ja: 全て保存(_A)

source: Clos_e All
ar: أغل_ق الكل
ja: 全て閉じる(_e)

source: _Opened Documents
ar: المستندات ال_مفتوحة
ja: 文書を開く(_O)

source: _Closed Documents
ar: المستندات الم_غلقة
ja: 文書を閉じる(_C)

source: _Help
ar: _مساعده
ja: ヘルプ(_H)

source: _Highlight
ar: _توضيح التركيب

source: Failed to initialize the networking backend.
ar: فشل بدأ خلفية الشبكة.

source: Couldn't initialize network handler.
ar: تعذّر بدأ معالج الشبكة.

source: Please set the proxy authentication username.
ar: فضلًا ضع اسم مستخدم استيثاق الوكيل.

source: Please set the proxy authentication password.
ar: فضلًا ضع كلمة سر استيثاق الوكيل.

source: Please set a proxy host.
ar: فضلًا حدد مستضيف وكيل.

source: Location
ar: الموقع
ja: 場所

source: _Insert into the active document.
ar: أ_درِج في الملف المفتوح.
ja: アクティブな文書に挿入(_I)

source: You must enter a location to open.
ar: يجب إدخال موقع لفتحه.
ja: 開く場所を入力してください

source: I can't execute %s. I can't find it in your path
ar: لا يمكن تنفيذ %s. لا يمكن العثور عليه

source: Couldn't get the required content.
ar: لم أتمكن من الحصول على المحتوى المطلوب.
ja: 要求したコンテンツを取得できません

source: Preferences
ar: الإعدادات
ja: 設定

source: Options for
ar: خيارات
ja: オプション

source: General
ar: عام
ja: 全般

source: Interface
ar: الواجهة
ja: インタフェース

source: Tabs
ar: الألسنة
ja: タブ

source: Editor
ar: المحرر
ja: エディタ

source: Encodings
ar: الترميزات
ja: エンコーディング

source: File Save
ar: حفظ الملفات
ja: ファイル保存

source: Spell Checker
ar: تدقيق إملائي
ja: スペル確認

source: Print
ar: الطباعة
ja: 印刷

source: Remote Documents
ar: المستندات الخارجية

source: Advanced
ar: متقدم
ja: 高度

source: Network
ar: الشبكة

source: Print preview
ar: معاينة الطباعة
ja: 印刷プレビュー

source: of %i
ar: من %Ii

source: Other
ar: أخرى

source: Print to file.
ar: اطبع إلي ملف.
ja: ファイルに印刷

source: _All
ar: ال_كل
ja: 全て(_A)

source: _Selection
ar: ال_تحديد
ja: 選択(_S)

source: _Lines
ar: _سطور
ja: 行(_L)

source: Printer:
ar: الطابعة:
ja: プリンタ:

source: Location:
ar: المكان:
ja: 場所:

source: Number of copies
ar: عدد النسخ
ja: コピーの数

source: Print range
ar: مدى الطباعة
ja: 印刷幅

source: From:
ar: من:

source: To:
ar: إلي:

source: Paper size:
ar: حجم الورق:
ja: 紙のサイズ:

source: Page orientation:
ar: اتجاه الصفحة:
ja: ページの方向:

source: Printer name
ar: اسم الطابعة
ja: プリンタの名前

source: Status
ar: الحالة
ja: ステータス

source: Custom
ar: مخصص
ja: カスタム

source: Create a PDF document
ar: أنشئ ملف PDF
ja: PDF ドキュメントを作成

source: Create a Postscript document
ar: أنشئ ملف Postscript
ja: Postscript ドキュメントを作成

source: Portrait
ar: طولي
ja: 縦長

source: Landscape
ar: عرضي
ja: 横長

source: Width:
ar: العرض:
ja: 幅:

source: Height:
ar: الارتفاع:
ja: 高さ:

source: Please choose a file to print to.
ar: فضلا اختر ملفا للطباعة.
ja: 印刷するファイルを選んでください

source: Please choose a file not a directory.
ar: فضلا اختر ملفا وليس دليلا.
ja: ディレクトリではなくファイルを選んでください

source: Please select a file to print to.
ar: فضلا اختر مكان ملف للطباعة.
ja: 印刷するファイルを選んでください

source: I couldn't get the selected printer.
ar: لم أتمكن من تحديد الطابعة المختارة.
ja: 選んだプリンタに接続できません

source: Find
ar: ابحث
ja: 検索

source: Search for:
ar: ابحث عن:
ja: 検索する語:

source: Replace with:
ar: استبدل بـ:
ja: 置き換える語:

source: Match entire word only
ar: طابِق كامل الكلمة فقط
ja: 完全に一致する語のみ

source: Match case
ar: طابِق حالة الأحرف
ja: 大文字小文字を区別

source: Wrap search
ar: لف حول
ja: 循環して検索

source: Search from the cursor position
ar: ابحث من مكان المؤشر
ja: カーソル位置から検索

source: Search backwards
ar: ابحث إلى الخلف
ja: 後方に検索

source: Search from the beginnig of the document
ar: ابحث من بداية المستند
ja: 文書の最初から検索

source: _Replace
ar: استب_دل
ja: 置換(_R)

source: Replace _All
ar: استبدل ال_كل
ja: 全て置換(_A)

source: Failed to initialize the spell checker
ar: فشل بدأ المدقق الإملائي

source: Failed to set the requested dictionary.
ar: تعذّر ضبط القاموس المطلوب.

source: _Ignore
ar: _تجاهل
ja: 無視(_I)

source: Ignore _All
ar: تجاهل ال_كل
ja: 全て無視(_A)

source: C_hange
ar: _بدِّل
ja: 変更(_h)

source: _Add to user dictionary
ar: أ_ضف إلى القاموس
ja: ユーザ辞書に追加(_A)

source: Misspelled:
ar: الكلمة الخاطئة:
ja: スペル間違い:

source: Change to:
ar: بدِّل إلى:
ja: 次の語に変更:

source: Check Spelling
ar: تدقيق إملائي
ja: スペルをチェック

source: Suggestions
ar: الاقتراحات
ja: 提案

source: No misspelled words.
ar: لا توجد كلمات أخرى غير صحيحة.
ja: スペル間違いはありません

source: OVR
ar: استبدال
ja: 上書き

source: INS
ar: إدراج
ja: 挿入

source: L: %d, C: %d
ar: س: %Id، ع: %Id
ja: 行: %d, 列: %d

source: Search
ar: ابحث
ja: 検索

source: Spelling Dictionary
ar: قاموس الإملاء
ja: スペル用の辞書

source: Create a new file
ar: أنشئ ملف جديد
ja: 新規ファイルを作成

source: Open a file for editing
ar: افتح ملف للتحرير
ja: 編集用にファイルを開く

source: Save the existing file
ar: احفظ الملف الحالي
ja: 既存のファイルを保存

source: Print this document
ar: اطبع هذا المستند
ja: この文書を印刷

source: Close the active file
ar: اغلق الملف الحالي
ja: 現在のファイルを閉じる

source: Undo
ar: تراجع
ja: アンドゥ

source: Redo
ar: أعِد
ja: リドゥ

source: Cut
ar: قص
ja: 切り取り

source: Copy
ar: انسخ
ja: コピー

source: Paste
ar: الصق
ja: 貼り付け

source: Delete current selection
ar: احذف الجزء المحدد
ja: 選択したものを削除

source: Toggle full screen mode
ar: بدِّل وضع ملء الشاشة

source: I can't backup the old file.
ar: لم أتمكن من عمل نسخة احتياطية.

source: %s is a directory.
ar: %s دليل.

source: The keyboard emulator will not work.
ar: محاكي لوحة المفاتيح لن يعمل.
ja: キーボードエミュレータは動きません

source: Multipress will not work.
ar: متعدد الضغطات لن يعمل.

source: A lot of the configuration options have been changed in this version. Please adjust the configuration first.
ar: تغيرت العديد من خيارات الضبط في هذا الإصدار. يرجى ضبط الإعدادات أولا.
